output_parent_dir="datasets/split/independent_vowels/PXL_20221005_064851272"
input_file="datasets/raw/PXL_20221005_064851272.mp4"
clips=(
  'ឥ-00:00:05-00:00:06'
  'ឦ-00:00:10-00:00:11'
  'ឧ-00:00:21-00:00:22'
  'ឪ-00:00:48-00:00:49'
  'ឫ-00:00:55-00:00:57'
  'ឬ-00:01:09-00:01:10'
  'ឭ-00:01:20-00:01:22'
  'ឮ-00:01:33-00:01:34'
  'ឯ-00:01:38-00:01:40'
  'ឰ-00:01:51-00:01:52'
  'ឱ-00:01:57-00:01:58'
  'ឳ-00:02:04-00:02:05'
)

./scripts/base/trim_video.sh $output_parent_dir $input_file ${clips[@]}
