output_parent_dir="datasets/split/independent_vowels/PXL_20221005_064550141"
input_file="datasets/raw/PXL_20221005_064550141.mp4"
clips=(
  'ឥ-00:00:02-00:00:03'
  'ឦ-00:00:07-00:00:09'
  'ឧ-00:00:14-00:00:15'
  'ឪ-00:00:36-00:00:38'
  'ឫ-00:00:49-00:00:50'
  'ឬ-00:00:56-00:00:58'
  'ឭ-00:01:08-00:01:09'
  'ឮ-00:01:15-00:01:17'
  'ឯ-00:01:43-00:01:46'
  'ឰ-00:01:54-00:01:57'
  'ឱ-00:02:05-00:02:08'
  'ឳ-00:02:16-00:02:18'
)

./scripts/base/trim_video.sh $output_parent_dir $input_file ${clips[@]}
