output_parent_dir="datasets/split/independent_vowels/PXL_20221005_065137785"
input_file="datasets/raw/PXL_20221005_065137785.mp4"
clips=(
  'ឥ-00:00:10-00:00:11'
  'ឦ-00:00:15-00:00:16'
  'ឧ-00:00:21-00:00:22'
  'ឪ-00:00:32-00:00:34'
  'ឫ-00:00:39-00:00:40'
  'ឬ-00:00:50-00:00:52'
  'ឭ-00:01:03-00:01:04'
  'ឮ-00:01:08-00:01:09'
  'ឯ-00:01:13-00:01:15'
  'ឰ-00:01:29-00:01:31'
  'ឱ-00:01:37-00:01:38'
  'ឳ-00:02:42-00:02:43'
)

./scripts/base/trim_video.sh $output_parent_dir $input_file ${clips[@]}
